{
	"version": "1.0.0",
	"steps": [
		{
			"id": 1,
			"description": "Game entry point. Introduces Pip and indicates city location. Corn chip choices.",
			"content": [
				"You are a <span class=\"substep\" data-substep=\"1\">pigeon</span> named Pip in your prime. How coo is that? You reckon it's pretty coo.",
				"Yaaaaaaawn. What a beautiful day in the neighborhood. The rising sun shines through sparse clouds, illuminating the surrounding rivers and city buildings.",
				"A corn chip rests conveniently by your feetsies..."
			],
			"substeps": [
				{
					"id": 1,
					"text": "Yes, a pigeon. Stunning royal blue and gray feathers. Orange feetsies."
				}
			],
			"choices": [
				{
					"text": "Crunch that chip",
					"nextStepId": 2,
					"logChoice": false
				},
				{
					"text": "Skip the chip",
					"nextStepId": 3,
					"logChoice": false
				}
			]
		},
		{
			"id": 2,
			"description": "You ate your first corn chip.",
			"content": [
				"Delicious chip carbs fill your feather bod. Your energy goes up by 10. Hmmm... 10 what exactly?",
				"You're not sure, but 10 feels like the right number unit. Welp, time to fly around this town like no one's business."
			],
			"substeps": [],
			"choices": [
				{
					"text": "Fly to that bridge over yonder",
					"nextStepId": 4,
					"logChoice": false
				}
			]
		},
		{
			"id": 3,
			"description": "No chips!! Just coffee for breaky!!",
			"content": [
				"Too good for a carb-heavy breakfast, eh? Just a coffee-and-go kind of bird.",
				"You fly to the nearest cafe and take a <span class=\"substep\" data-substep=\"1\">BIG SIP</span> from a half-full mug left on a patio table.",
				"Full on caffeinated, you fly like a bird out of hell in several circles because you feel ALIVE. Let's put this perpetual birdmotion machine to work!"
			],
			"substeps": [
				{
					"id": 1,
					"text": "SIIIIIIIP. The lukewarm bev flows through you. It's the perfect ratio of cream to coffee. Now you are ready for action."
				}
			],
			"choices": [
				{
					"text": "FLY OVER TO A BRIDGE WITH INTENT",
					"nextStepId": 4,
					"logChoice": false
				}
			]
		},
		{
			"id": 4,
			"description": "You found the skate punk cat teens...",
			"content": [
				"You fly by the bridge over the east river. A group of cat <span class=\"substep\" data-substep=\"1\">teenagers</span> are sitting on a big chunk of cement under the bridge, smoking cigarettes.",
				"They furtively look around. Pretty obvious they aren't old enough for those 100s.",
				"A bold teen from the cat gang steps forward. Oh no, he's both a crust punk AND challenging you to a skate off! A lethal combo. Do you.."
			],
			"substeps": [
				{
					"id": 1,
					"text": "Cooler than you. Wearing t-shirts featuring bands you’ve never heard of: Death by Plastic Monstertruck, Puddleslap, Figboy and the Newtons."
				}
			],
			"choices": [
				{
					"text": "shred that gnar",
					"nextStepId": 5,
					"logChoice": false
				},
				{
					"text": "Ask if he's seen any good movies lately",
					"nextStepId": 6,
					"logChoice": false
				}
			]
		},
		{
			"id": 5,
			"description": "Pick your skate option to race Carl!",
			"content": [
				"The cat crust punk sneers as he itches his ear and flicks the end of a cheap cigarette at you, but graciously allows you to pick your method of shreddin'. You think to yourself everything cats do is adorable no matter how much they try to be hardcore.",
				"Looking into his arsenal reveals three choices of handlebar-less transportation:"
			],
			"substeps": [],
			"choices": [
				{
					"text": "the ripped denim tradition of a regular skateboard",
					"nextStepId": 7,
					"logChoice": false
				},
				{
					"text": "the big sur longboard cruiser",
					"nextStepId": 8,
					"logChoice": false
				},
				{
					"text": "the alternative boot-glide of rollerblades",
					"nextStepId": 9,
					"logChoice": false
				}
			]
		},
		{
			"id": 6,
			"description": "No skating, just chat with Carl. He gives you binary code paper",
			"content": [
				"You befriend the cat and learn his name is Carl. He seems like a sensitive and insightful soul.",
				"You learn Carl enjoys painting water colors of 1980s action film scenes. After a pleasant conversation involving comparisons of your best <span class=\"substep\" data-substep=\"1\">Terminator impressions</span>, you bid farewell to your new friend.",
				"Just before you leave, Carl slips you a piece of paper with a strange series of binary code on it. He says, \"You're alright Pip, ya know that. A real Maverick. I'm sure we'll see each other again soon.\"",
				"You say \"Thanks, <span class=\"substep\" data-substep=\"2\">Goose</span>\" and take the slip paper."
			],
			"substeps": [
				{
					"id": 1,
					"text": "Real classics like \"I'll be back\" and \"Chill out, dickwad.\""
				},
				{
					"id": 2,
					"text": "<img src=\"assets/maverick.gif\" alt=\"Maverick\" />"
				}
			],
			"choices": [
				{
					"text": "Fly home Top Gun style",
					"nextStepId": 10,
					"logChoice": true
				}
			]
		},
		{
			"id": 7,
			"description": "Win the race with a skateboard! Get a binary code paper!",
			"content": [
				"Ah, yes. The traditional skateboard.",
				"You could legitimately wear a Thrasher t-shirt, but they don't come in tiny bird sizes.",
				"You skate with the valience of ten thousand Greek chariots and so does the crust punk, but ultimately you best him.",
				"You do a kickflip to rub victory in his face a little, and he sadly offers you a slip of paper as a reward. Aw, he seems like a sensitive soul.",
				"The paper has a cryptic series of binary code on it. Cryptic, but not encrypted... huh."
			],
			"substeps": [],
			"choices": [
				{
					"text": "Fly home with your spoils",
					"nextStepId": 10,
					"logChoice": true
				}
			]
		},
		{
			"id": 8,
			"description": "Lost the race with a longboard. Get a binary code anyways!",
			"content": [
				"Like your father before you, you are a true Cali brah in your salty pigeon heart.",
				"With the grace of a 120 year old sea turtle you carve slow S's down the hill. In that moment you swear you are infinite - since it certainly takes you long enough to complete the race.",
				"The crust punk easily beats you speed wise, but is moved to tears by your beautious display. He slips you a non-slippery slip of paper as a reward.",
				"He seems like a sensitive soul. You notice the paper is covered in strange binary code..."
			],
			"substeps": [],
			"choices": [
				{
					"text": "Fly home slow & steady, brah",
					"nextStepId": 10,
					"logChoice": true
				}
			]
		},
		{
			"id": 9,
			"description": "Win the race with sweet blades brah!",
			"content": [
				"With your tiny foot chariots, you blaze down the hill like hell and think to yourself: this feels like flying!",
				"Cross-checking with your memories of actual flight, it is pretty similar.",
				"It's a tie down to the milisecond. You're not sure why this crust punk went through all the trouble of setting up professional-level tech for a street match but you feel cool as a participant.",
				"He hands you a slip of paper and says Excellent match, you've earned this. Brink was a really underrated Disney made-for-tv movie. and seems to genuinely mean it. A sensitive soul he is.",
				"The paper is covered in a mysterious series of binary code..."
			],
			"substeps": [],
			"choices": [
				{
					"text": "Actually fly and not rollerblade home",
					"nextStepId": 10,
					"logChoice": true
				}
			]
		},
		{
			"id": 10,
			"description": "Get home after your first day out n about",
			"content": [
				"You fly home and let out a big sigh.",
				"You lay down in your feather down bed and try to go to sleep, but that “take me home country roads” song is stuck in your head for no reason.",
				"Musical stylings of John Denver aside, you play through the day's events in your mind... pausing to consider that mysterious binary code."
			],
			"substeps": [],
			"choices": [
				{
					"text": "Sleep comes eventually, Mountain Mama",
					"nextStepId": 11,
					"logChoice": false
				}
			]
		},
		{
			"id": 11,
			"description": "Day 2 begins - you eat a corn chip & gotta decide where to go",
			"content": [
				"Another day, another corn chip. You eat the corn chip and it is so delicious you want to start a relationchip with it.",
				"Or rather, you want someone to share in this chip fortune with you in a real relationship kind of way. You could made chip puns together.",
				"Hmm. That would be nice.",
				"Your reverie is usurped by thoughts of the mysterious binary code acquired yesterday. You figure there's a few places that may provide a bit more insight.."
			],
			"substeps": [],
			"choices": [
				{
					"text": "Go to the Cathedral of Learning",
					"nextStepId": 12,
					"logChoice": false
				},
				{
					"text": "Go to the Supercomputing Center",
					"nextStepId": 13,
					"logChoice": false
				}
			]
		},
		{
			"id": 12,
			"description": "",
			"content": [
				"As a bird with a hungry mind, you enjoy living close to the Cathedral of Learning.",
				"As you approach that tall tower of tutelage, you see a possum friend named <span class=\"substep\" data-substep=\"1\">Ira</span> from art electives back at University.",
				"After initial pleasantries you can tell something is up. She sighs after long sentences and you notice dark circles under her eyes that have nothing to do with post-grunge eyeliner.",
				"Ira confesses she's mega bummed since her award-winning design agency job isn't what she imagined and it's draining her of creativity and personal-life energy points."
			],
			"substeps": [
				{
					"id": 1,
					"text": "Ira was cool for sure. She cracked the best jokes in still life illustration class. During nude drawing sessions, she called it the Art S'nudio. Ha. Classic."
				}
			],
			"choices": [
				{
					"text": "Listen sincerely",
					"nextStepId": 14,
					"logChoice": false
				},
				{
					"text": "Share a relatable story",
					"nextStepId": 15,
					"logChoice": false
				}
			]
		},
		{
			"id": 13,
			"description": "You picked supercomputing center, but are distracted by restaurant choices - deli or hipster bistro?",
			"content": [
				"Ah the Supercomputing Center. The center for all things super and computing. As this binary code probably definitely relates to these things, you head on over.",
				"On the way, you notice a new restaurant opening up on the Northside next to the old deli.",
				"That deli rules. They put banana peppers on every sandwich. The old Deli Man there called that came in either Dorothy or Donnie. A dreamy old <span class=\"substep\" data-substep=\"1\">sandwich emporium</span>, indeed.",
				"However the new restaurant looks pretty swanky. A man dressed in suave hipster attire heralds people towards the entrance. Is he really waving his Premiumley Waxed beard at people? Is he offering free kombucha? Is that...a bowl of artisan corn chips???"
			],
			"substeps": [
				{
					"id": 1,
					"text": "A deli paradise. That's the kind of utopia I want to live in, forever."
				}
			],
			"choices": [
				{
					"text": "Grab a traditional deli sando for the road",
					"nextStepId": 16,
					"logChoice": true
				},
				{
					"text": "Embrace change & try out the new restaurant",
					"nextStepId": 17,
					"logChoice": true
				}
			]
		},
		{
			"id": 14,
			"description": "Listen sincerely to Iras predicament then show her binary code paper",
			"content": [
				"You listen sincerely to Ira's tale of grueling agency churn & burn, spending long hours toiling for peanuts.",
				"It makes you a bit sad in your core. How come such a creative person should burn themselves out like this? But...she has certainly built quite a portfolio out of it.",
				"Maybe everyone has to put in those hell-grindy hours and get sad before bustin' out like a caterpillar turning into a <span class=\"substep\" data-substep=\"1\">butterfly</span>.",
				"You say, \"Ira. That sucks major tail! You are a cool person with the drive and know-how to destroy a small-to-medium sized planet. Destroy it with the power of your art!\"",
				"Ira smiles and says, \"Thanks Pip, means a lot. Why are you flying around these parts anyways?\""
			],
			"substeps": [
				{
					"id": 1,
					"text": "A metal butterfly destroying it’s Slayer chrysalis while double-bass drums resound in the background."
				}
			],
			"choices": [
				{
					"text": "Tell her about the binary code paper",
					"nextStepId": 19,
					"logChoice": false
				}
			]
		},
		{
			"id": 15,
			"description": "You shared a relatable story to Ira & kinda made it about you then show her the binary code",
			"content": [
				"You tell Ira a relatable story hoping to put her at ease to know the pain is shareable.",
				"You can’t stop sharing tales of your own cubicle woes. Oh no, what are you doing?",
				"The walls of your own sharing enclose around you like the walls of your old cubicle. A beige trap made of felt and some crappy metal. You picture <span class=\"substep\" data-substep=\"1\">Karen</span> your old coworker peeping over the wall at you.",
				"Finally, you look up and yell “Ira! Work is dumb but you aren’t. I have major respect for your art and your drive, girl. You can do this.”",
				"Ira looks at you for a solid 4 seconds before laughing and says “You’re a weird bird Pip, but I can dig it. Sounds like we had the same cubicle. And same Karen. What are you doing around the Cathedral anyways?”"
			],
			"substeps": [
				{
					"id": 1,
					"text": "Flashback to KAREN! DANG IT she doesn’t even know how to use Microsoft Paint don’t MESS WITH ME KAREN I SWEAR."
				}
			],
			"choices": [
				{
					"text": "Sheepishly continue to share, this time about the binary code paper",
					"nextStepId": 19,
					"logChoice": false
				}
			]
		},
		{
			"id": 16,
			"description": "You picked classic deli & recieve a delicious sando",
			"content": [
				"The deli door rings mellifluously. It triggers a sort of Pavlov response deep inside your bird body, and all you can think of is an italian sandwich on Mancini's bread. Extra banana peppers.",
				"The Deli Man says, \"Hey there Donnie, what'll it be?\" and you inform him of your Pavlovian desires.",
				"You acquire the best looking italian sando this world has yet known. And it is all yours."
			],
			"substeps": [],
			"choices": [
				{
					"text": "eat that sandwich NOW no time like the present!",
					"nextStepId": 18,
					"logChoice": false
				},
				{
					"text": "pack that pristine bread n meat stack for secret eating at a later time",
					"nextStepId": 26,
					"logChoice": false
				}
			]
		},
		{
			"id": 17,
			"description": "You picked hipster deli & waited for food. Gotta picked from 2 boujee food options",
			"content": [
				"You swoop down and sample an artisan corn chip. It has hints of rosemary, garlic, and nostalgia for a rustic time you were never a part of but it's nice to think so.",
				"You are told there will be a 30 to 45 minute wait by the chic looking hostess and you comply without thought. This will be worth it.",
				"Finally, blissfully, you are seated and get ready to order..."
			],
			"substeps": [],
			"choices": [
				{
					"text": "Bread olive and cheese board",
					"nextStepId": 21,
					"logChoice": false
				},
				{
					"text": "Breakfast for dinner, no one can stop you",
					"nextStepId": 22,
					"logChoice": false
				}
			]
		},
		{
			"id": 18,
			"description": "",
			"content": [
				"you eat the deli sando NOW"
			],
			"substeps": [],
			"choices": [
				{
					"text": "TODO: choice time",
					"nextStepId": 19,
					"logChoice": false
				}
			]
		},
		{
			"id": 19,
			"description": "",
			"content": [
				"You recount the crust punk happenings and show Ira the curious piece of paper.",
				"Ira takes the paper in her prehensile possum tail & studies it. “Hmm. Doesn’t say much other than <i>rum warehouse</i>.”",
				"On top of being a badass artist, apparently Ira is fluent in binary code. <span class=\"substep\" data-substep=\"1\">Dang</span>.",
				"You thank Ira for having such a cool brain and head out."
			],
			"substeps": [
				{
					"id": 1,
					"text": "Fluent in binary code, really though? Maybe you'll ask her to hang sometime to see what other stuff is going on in her steel trap of a brain. But she’s probably too cool and connected and maybe you’ll ask later and anyways you’re super busy solving this weird puzzle and and and and and AND"
				}
			],
			"choices": [
				{
					"text": "Ware is that warehouse again?",
					"nextStepId": 20,
					"logChoice": false
				}
			]
		},
		{
			"id": 20,
			"description": "Flying to & finding the rum emporium",
			"content": [
				"The Rum Warehouse is a blue cinder block building by a bridge and train tracks.",
				"You fly in random circles patterns until you spy a match & swoop in, tucking your wings close to your bod while making divebomb sound effects - NEeeeEEERRRRRRR PSHHHHHH!!",
				"While landing, you sincerely hope no passersby heard your potentially embarassing beak-sounds and ransack your bird brain for relevant info...",
				"The owner and distiller is a <span class=\"substep\" data-substep=\"1\">no-nonsense type</span> with a steely gaze and quiet disposition. He was once featured in the news and didn't have much to say. Word around town is he doesn't need to, since the product speaks for itself. Hmmm."
			],
			"substeps": [
				{
					"id": 1,
					"text": "The kind you would suspect can't stand social media & wants to stick it to The Man. Do people still say that? Eh, rather, he doesn't prefer authority figures."
				}
			],
			"choices": [
				{
					"text": "Cross the nondescript threshold into the rum emporium",
					"nextStepId": 23,
					"logChoice": false
				}
			]
		},
		{
			"id": 21,
			"description": "",
			"content": [
				"You picked Bread olive and cheese board from hipster restaurant"
			],
			"substeps": [],
			"choices": [
				{
					"text": "TODO: what now",
					"nextStepId": 21,
					"logChoice": false
				}
			]
		},
		{
			"id": 22,
			"description": "You ordered breakfast for dinner at the boujee hipster joint.",
			"content": [
				"Breakfast. A beautiful meal which consists of a venn diagram of both protein-packed options or sweet, sweet carbohydrate cakes.",
				"The time of day doesn't confine you to the types of foods you consume! You are your own bird.",
				"Being a <span class=\"substep\" data-substep=\"1\">boujee hipster bistro</span>, the breakfast options consist of lebda, salmon, and lemon poppyseed.",
				"The food transports you into a state of bliss that is only interuppted by the nagging feeling you have an unsolved mystery at wing.",
				"The binary code is face-up on the table as you finish your meal, and notice a pool of syrup has coated a corner of the paper."
			],
			"substeps": [
				{
					"id": 1,
					"text": "The food IS delicious as it is expensive. Is this the natural progression of modern eating or is this a construct of gentrification AKA a more sinister manifestation of how the haves and have nots spend their time and money? Is a bistro just a bistro anymore?"
				}
			],
			"choices": [
				{
					"text": "Pay the steep tab (oof) & head towards the Cathedral of Learning with fiery research intentions",
					"nextStepId": 24,
					"logChoice": false
				},
				{
					"text": "Pay the steep tab (yikes) & ask that bearded hipster man on the way out if he knows a thing or two about binary code",
					"nextStepId": 25,
					"logChoice": false
				}
			]
		},
		{
			"id": 23,
			"description": "Youve just entered the rum emporium",
			"content": [
				"Youve just entered the rum emporium"
			],
			"substeps": [],
			"choices": []
		},
		{
			"id": 24,
			"description": "Leave the boujee bistro after breakfast for din && go to the Cathedral of Learning",
			"content": [
				""
			],
			"substeps": [],
			"choices": []
		},
		{
			"id": 25,
			"description": "Ask that beardy hipster man about binary code after breakfast for din",
			"content": [
				""
			],
			"substeps": [],
			"choices": []
		},
		{
			"id": 26,
			"description": "You packed your sando & hit the road to the supercomputing center",
			"content": [
				""
			],
			"substeps": [],
			"choices": []
		}
	]
}
